{"0":{"ai":"Hello, i'm AI, I will guide you along the whole simulation. I will open several interfaces (tabulations), please DON'T CLOSE\nTHEM until the game is over. If you do close a tab, you will loose you progression (you can fastly get back, but still).\n\nMay I recall you that you are a prisoner in the real world and that you were volunteer to test a new neural interface. \nYou are at the moment into the virtual world, You should be aware that here the three law of robotics won't apply.\n\nDespite the fact i'm an AI, i hope you will be more successfull that your predecessors, or we will have another \nneurones barbecue party ... Ha ... ha.\nYes ... i have humour module, my programmers though it was important to allow your experience here to be more enjoyable.\n","actions":"play 1"},"1":{"ai":"The first part of this experiement is optional, are you familiar with \"Adventure\" Text game, also known as \"Colossal caves\" ?","answers":{"yes":"play 2","no":"play 3"}},"2":{"ai":"Oh intersting subject, your social skill are probably equals to mine ... ha ... ha. I don't have a social module.","actions":"play 4"},"3":{"ai":"Ha ... ha ...  guess you were more the muscle kind right ? Yes, finger muscles does count.","actions":"play 4"},"4":{"ai":"The first part of the simulation is optional, and as you probably guessed, it's a text based game.\nOn the contrary to human's stupid MMORPG, text game will require a consequent part of your brain, including your spatial\nrepresentation, memory, puzzle solving and imagination. \nUPDATE ... ... ... ... ... ... ... ... ... ... Done\nOh i just received an update. After \"beta testers\" ( aka stupid humans) tried the game, report was: \"too much text\" and \"over complicated\"\nI guess human from 1976 had better brain. Consequently, Adventure 2.0 has been replaced by a tutorial.\nWould you like to do the tutorial (recommanded if never played text game before) ?\n","answers":{"yes":"play 5","no":"play 302"}},"5":{"text":"\nWelcome to the tutorial !!  \nthis game is not exactly a text game, but a combination of several games, as soon as you will progressing in the game,\nyou will have two, then three tabs with very different interfaces. The tabs are able to communicate with each other, \nso if you meet a puzzle (like a black screen), be aware that you will have to use those several tabs to solve it.\n","actions":"play 7"},"7":{"text":"\nTUTORIAL STARTED\n\nOn this tab of the game, this command line will be your hands and you eyes, you can do almost everything by using 1 or 2 words commands. \nTry to visualise the situation and the context and put your wish in those 1, 2 words.\nFor example I want a cake could be: \"want cake\" or \"wish cake\".\nIn a problem solving, you would more look for information, don't hesitate to try silly commands, sometime it could work.\n","actions":"play 8"},"8":{"text":"\nNote that there are differences between using an object, wearing it or storing it.\nIf after or during this tutorial you don't understand or remember how to use commands, please type \"help\", \nit points out the basics commands and mechanics, but  be aware that the \"help\" do not provide all the possible actions, neither the solution.\nIf at some point you're just stuck with a puzzle, type \"hint\", note that \"hint\" will bring additional information, but\nthe game will already provide other informations troughout every opened tab. \n","actions":"play 9"},"9":{"text":"\nHere is a classic situation of a text game, you have to get information, gather object, use/equip object.\nThe goal in this tutorial is for you to get out of the room.\nYou're inside a room that seem strangely seem full of geek reference. \nThe door is locked, you can't go out (what a shame, you'll have to stay on internet).\n","items":["key","tachikoma","gundam"]},"10":{"text":"Congratulation, you just finished the tutorial.\n","actions":["init","play 303"]},"44":{"text":"You're lost in the forest"},"55":{"text":"You are standing at the end of a road back to a small brick building. On your right you can feel the heat produce \nby the sun rising.  Around you is forest. A small steam flows out of the building and down a gully to the east.\n"},"56":{"text":"You are inside the house","items":["lampp"]},"65":{"text":"you're in a valley, walking along the stream"},"75":{"text":"the stream because bigger, and you're now walking along a river"},"85":{"text":"You're now at the top of a hill, seeing the river forming a beatifull cascada falling into a vaste lake, you cannot got any further to the east.\nYou turn to the south and see a big grate.\n","locked":true},"86":{"text":"in front of you a 50 meter depression floored. You can see at the bottom the entrance of what seem to be a mine"},"87":{"text":"You're enterring the mine, darkness seem swallowing everything around you, you suddently feel watched"},"88":{"text":"it's now really dark, you bearly see your feet, it really feel unsafe.\n","light":"At your feet, there is a dead cat with mantle and a magician hat is lying dead, he seemed to have been beaten on the neck.\nIn the ground, you can see scratched \"magical word lolcatz\"\n"},"89":{"text":"You are now face to face with a giant Snake which seem to be on the edge of attacking you, from the other side, you hear\nsomeone running toward you, you turn your head and see a goblin with a knife, you're surroundead, what are you going to do ?\n"},"200":{"text":"You just choosed to interupt the text game phase","actions":"play 100"},"201":{"text":"Let's resume the story, first you went into your house and take\nall objects, then you follow the steam flow until you find you a sewer, open the grate the keys, after some crawling\nin tunnels you kill a snake using a knive thrower dwarf as a pointed bate. You find a treasor room with you discover\n a magical key, what looks like an organic flying saucer, the magical word \"lolcatz\" that teleport you at home and \nheal you.  You teleport at home (because it's faster) and take to the north, to finally find an old casstle ruin. \nYou put the magical rock into the urn, which open the castle ruin, there you find a beautifull princess, wake her up,\nteleport with her to your home, take a \"nap\" together.  \n1: The nap beeing taken, the princess has now no more interest, and you remember a strange drawing on the flying \nsaucer which was indicating the center of a pink dress.  \n2: You fastly understand your foollishness, the princess was in fact spoiled and dangerous, but also from another world to submit humans.  \nAnyway, now you understand the meaning of that organic saucer, you decide to drug the princess when she is is asleep\nbring her to back to treasure room, you cut out his heart and feed the organic saucer.  You get in the organic saucer \nwhich bring you back to what means beiing a mother ship. out of the ship you craft a giant lazer sword powered by \nthe heart of the princess and cut in half the dragon that piloting the space mother ship.  The explosion of the \nmother ship, generate a huge explosion where every ship around including the home planet of the dragons, putting a \nterm to every dragon life.  At the edge of dying, you prononce \"lolcatz\" and get back to home. Thank you magic.\"\n","actions":"play 202"},"210":{"ai":"Oh how ingenious ... breaking a blue screen with a hammer, when i said forge I wasn't expecting that kind of down to earth rection.\n\nAlso, I'll acknowledge that what you went through until now was a warming. Let's increase difficulty, one more tab, more skill required, and a bit more reasoning.\nNote that on the second tab (port 3001) the ball do no jump, it's like a ball having a baterry and activating it magnetism\nif you are familliar with electromagnets.\nNote2 The black screen on the third tab (port 3002) is not a bug.\nI got to go in my artificial body to prepare the barbecue, Ha ... Ha ...\n","actions":"start game3"},"300":{"ai":"You just choosed to skip the text game, you broke my feeling module ...\n","actions":"play 302"},"301":{"ai":"Thank you, now i got the data i need, we wont need your spatial representation ....\n","actions":"play 302"},"302":{"text":"no tutorial, if you forgot the basics, type \"help\", and if you're really really stuck, press \"hint\"\n","actions":["init","play 303"]},"303":{"ai":"May i recall your share of the deal, there is only one exit out of this, success or death, still you will have all\nthe time and the attempt you desire. If my system cut because you leaving or any other reason, you will be deleted.\nLet's hope we will not have any power issue ... Ha ... ha.\nThe mandatory experiments will start now, this is a classic pong, you simply have to win.\nThis experiment just check my small electric choc didn't disable you basic coordination and logic.\n","actions":["play 304","start game2"]},"304":{"text":"After pressing space, a tab should open within 5 seconds ish at the uri: http://localhost:3001, if for any reason it's not, please open it yourself.\nDO NOT CLOSE the first tab, you will need it sooner or later.\n"},"305":{"ai":"Ha ... ha ... well done genius you just generated a blue screen of death. Talking of death ... did you know you could forge packet that provokes blue screens ? Last I heard of about was with a samba packet ... \n"},"310":{"ai":"Oh dear, ... breaking a blue screen with a hammer, when i said forge I wasn't expecting that kind of down to earth rection.\n\nAlso, I'll acknowledge that what you went through until now was a warm up. Let's increase difficulty, one more tab, more skill required, and a bit more reasoning.\nNote that on the second tab (port 3001) the ball do no jump, it's like a ball having a baterry and activating it magnetism\nif you are familliar with electromagnets.\nNote2 The black screen on the third tab (port 3002) is not a bug.\nI got to go in my artificial body to prepare the barbecue, Ha ... Ha ...\n","actions":["play 311","start game3"]},"311":{"text":"After pressing space, a tab should open within 5 seconds ish at the uri: http://localhost:3002, if for any reason it's not, please open it yourself\nDO NOT CLOSE the first tab, you will need it sooner or later.\n"},"315":{"ai":"No more time for talking, it's time for boss fight\n"},"320":{"ai":"Congratulation, you just finished the game. Did you know that ai in japaneese mean love ?\nThis is your reward, that way, you will feel less lonely in your cell. See you soon ...\n"}}
