{"0":{"ai":"Hello, i'm AI, I will guide you along the whole simulation.\nMay I recall you that you are a prisoner in the real world and that you were volunteer to test the new neural interface. \nYou just have been transported to the virtual world.\nYou should be aware that the three law of robotics won't apply for you as long as you're a prisonner.\n\nDespite the fact i'm an AI, i hope you will be more successfull that yours predecessors, or we will have another \nneurones barbecue party ... Ha ... ha.\nYes ... i have humour module, my programmers though it was important to allow your experience here to be more enjoyable.\nI do not enjoy killing human ... not at all, torture ... is another topic.\n","actions":"play 1"},"1":{"ai":"The first part of this experiement is optional, are you familiar with \"Adventure\" Text game, also known as \"Colossal caves\" ?","answers":{"yes":"play 2","no":"play 3"}},"2":{"ai":"Oh intersting subject, your social skill are probably equals to mine ... ha ... ha. I don't have a social module.","actions":"play 4"},"3":{"ai":"Ha ... ha ... you're more the muscle kind right ? Yes, finger muscles does count.","actions":"play 4"},"4":{"ai":"The first part of the simulation is optional, and you probably guessed, it's a text based game.\nOn the contrary to human's stupid MMORPG, text game will require a consequent part of your brain, including your spatial\nrepresentation, memory, puzzle solving and imagination. \nUPDATE ... ... ... ... ... ... ... ... ... ... Done\nOh i just received an update. After the beta tester tried the game, they all said \"too much text\" and \"over complicated\"\nI guess human from 1976 had better brain. Adventure 2.0 has been replaced by a tutorial.\nWould you like to do the tutorial (recommanded if never played text game before) ?\n","answers":{"yes":"play 5","no":"play 302"}},"5":{"text":"Welcome to the tutorial !!  \n\nthis game is not exactly a text game, but a combination of several games, as soon as you will progressing in the game,\nyou will have two, then three tabs, the tabs are able to communicate with each other, so if you meet situation, be \naware that you will have to use those several tabs to solve it.\n","actions":"play 7"},"6":{"text":"You should know that's it's not exactly a text adventure, it shape will change and include\ncanvas + mouse + keyboards interactions. I intended to put a text game to start as long as i felt it was incredibily \nrefreshing to use my brain that way, thing that i didn't do for a long time with those recent shiny video games. \n(without quoting exceptions of course), The text adventure is short but if you really don't like textgame or if you're \nnot in the mood you can skip at any moment the first part by typing \"skip\", but be prepared to be spoiled.  \nStill, you will need some of the basic mechnics of the text game to be able to solve puzzle later, (when it will be\na matter of SKILL, you won't need it ^^). \n","actions":"play 55"},"7":{"text":"1. First, \"take\" the objects from the ground into your bag,\n2. Now, you can display the content of your bag by simply saying \"bag\" \n3. Then, try to get more information about the object you have in your possession\n4. Note you can \"equip\" object you have in your bag, equiping thing can be necesarry when you need to make a long work\nit, to show ennemies you ready to use that object.\nSome object don't need to be equiped to be used like the key or the lampp.\n5. When you'll have finish the tutorial please unlock the door.\n\nHere is a classic situation of a text game:\nYou're inside a room that seem strangely seem full of geek reference. \nThe door is locked, you can't go out (what a shame, you'll have to stay on internet).\n","items":["key","tachikoma","gundam"]},"8":{"text":"Congratulation, you just finished the tutorial.\n","actions":["init","play 303"]},"44":{"text":"You're lost in the forest"},"55":{"text":"You are standing at the end of a road back to a small brick building. On your right you can feel the heat produce \nby the sun rising.  Around you is forest. A small steam flows out of the building and down a gully to the east.\n"},"56":{"text":"You are inside the house","items":["lampp"]},"65":{"text":"you're in a valley, walking along the stream"},"75":{"text":"the stream because bigger, and you're now walking along a river"},"85":{"text":"You're now at the top of a hill, seeing the river forming a beatifull cascada falling into a vaste lake, you cannot got any further to the east.\nYou turn to the south and see a big grate.\n","locked":true},"86":{"text":"in front of you a 50 meter depression floored. You can see at the bottom the entrance of what seem to be a mine"},"87":{"text":"You're enterring the mine, darkness seem swallowing everything around you, you suddently feel watched"},"88":{"text":"it's now really dark, you bearly see your feet, it really feel unsafe.\n","light":"At your feet, there is a dead cat with mantle and a magician hat is lying dead, he seemed to have been beaten on the neck.\nIn the ground, you can see scratched \"magical word lolcatz\"\n"},"89":{"text":"You are now face to face with a giant Snake which seem to be on the edge of attacking you, from the other side, you hear\nsomeone running toward you, you turn your head and see a goblin with a knife, you're surroundead, what are you going to do ?\n"},"200":{"text":"You just choosed to interupt the text game phase","actions":"play 100"},"201":{"text":"Let's resume the story, first you went into your house and take\nall objects, then you follow the steam flow until you find you a sewer, open the grate the keys, after some crawling\nin tunnels you kill a snake using a knive thrower dwarf as a pointed bate. You find a treasor room with you discover\n a magical key, what looks like an organic flying saucer, the magical word \"lolcatz\" that teleport you at home and \nheal you.  You teleport at home (because it's faster) and take to the north, to finally find an old casstle ruin. \nYou put the magical rock into the urn, which open the castle ruin, there you find a beautifull princess, wake her up,\nteleport with her to your home, take a \"nap\" together.  \n1: The nap beeing taken, the princess has now no more interest, and you remember a strange drawing on the flying \nsaucer which was indicating the center of a pink dress.  \n2: You fastly understand your foollishness, the princess was in fact spoiled and dangerous, but also from another world to submit humans.  \nAnyway, now you understand the meaning of that organic saucer, you decide to drug the princess when she is is asleep\nbring her to back to treasure room, you cut out his heart and feed the organic saucer.  You get in the organic saucer \nwhich bring you back to what means beiing a mother ship. out of the ship you craft a giant lazer sword powered by \nthe heart of the princess and cut in half the dragon that piloting the space mother ship.  The explosion of the \nmother ship, generate a huge explosion where every ship around including the home planet of the dragons, putting a \nterm to every dragon life.  At the edge of dying, you prononce \"lolcatz\" and get back to home. Thank you magic.\"\n","actions":"play 202"},"202":{"text":"Congratulation, you just finished another the game !, now you had you amount of killing, princess, magics and \ntreasor go flip yourself.  I mean, what are the outcome of those gaming ? \nWant to challenge a real IA, and not those thing you in WOW, come i'm waiting for YA.\n","answers":{"yes":"play 204","no":"play 203"}},"210":{"text":"\nOh i'm usually against violence, but in that precise situation, i would have done the same. Blue screen are the dynosors of error reports, except they're not extinct.\nwhen we know that in 2012, windows has still a core inherently insecure, has not a pre emptive behavior, and still provide fragmentation through NTFS,\ndestruction seem charitable.\n-------------\nAlso, let's level up a bit: one more tab, more skill required, and a bit more reasoning.\n","actions":"start game3"},"300":{"ai":"You just choosed to skip the text game, you broke my feeling module ...\n","actions":"play 302"},"301":{"ai":"Thank you, now i got the data i need, we wont need your spatial representation ....\n","actions":"play 302"},"302":{"text":"no tutorial, if you forgot the basics, type \"help\"\n","actions":["init","play 303"]},"303":{"ai":"May i recall your share of the deal, there is only one exit out of this, success or death, still you will have all\nthe time and the attempt you desire. If my system cut because you leaving or any other reason, you will be deleted.\nLet's hope we will not have any power issue ... Ha ... ha.\nThe mandatory experiments will start now, this is a classic pong, you simply have to win.\nThis experiment just check my small electric choc didn't disable you basic coordination and logic.\n","actions":["play 304","start game2"]},"304":{"text":"After pressing space, a tab should open within 5 seconds ish at the uri: http://localhost:3001, if for any reason it's not, please open it yourself.\nDO NOT CLOSE the first tab, you will need it sooner or later.\n"},"305":{"ai":"Ha ... ha ... well done genius you just generated a blue screen of death. Talking of death ... did you know you could forge\npacket that provokes blue screens ? Last i heard about was with a samba packet ... \n"},"310":{"ai":"Attacking the computer to make it restart, destroying the screen with a hammer, what are you ? oh yeah, a human\nlike those who can farm/fight for hours to insert to get new recording in the database. \nIs improving your capability in the virtual world so difficult ? oh, i just check my memory, you can't, you're in prison.\nThat was not a mistake, just a failing check, that happens, programmers fault (most of those guy don't know TDD, or even\nIOC, can you imagine ? some of them are even on windows ^^. \n\nAlso, let's level up a bit: ... Ha ... ha.\nLet's get serious, one more tab, more skill required, and a bit more reasoning.\n","actions":["play 311","start game3"]},"311":{"text":"After pressing space, a tab should open within 5 seconds ish at the uri: http://localhost:3002, if for any reason it's not, please open it yourself\nDO NOT CLOSE the first tab, you will need it sooner or later.\n"},"320":{"ai":"Congratulation, you just finished the game. Did you know that ai in japaneese mean love ?\nThe real end is actually a big rpg boss, but the implementation is not finished !\n"}}
